from typing import List, Tuple
import sqlite3

# connect to db
conn = sqlite3.connect('../../db/database.db')
cursor = conn.cursor()

# create table
cursor.execute("""
CREATE TABLE IF NOT EXISTS teacher_qualification (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    teacher_name TEXT NOT NULL,
    qualification TEXT NOT NULL
)
""")
conn.commit()

# data
data: List[Tuple] = [
    ("Дегтярьова Любов Петрівна", "teacher_natural_sciences"),
    ("Нипорка Світлана Володимирівна", ""),
    ("Мудрак Галина Василівна", ""),
    ("Курочка Тетяна Валентинівна", ""),
    ("Ярмак Наталія Григорівна", ""),
    ("Хвостенко Тетяна Миколаївна", ""),
    ("Омельченко Вікторія Анатоліївна", ""),
    ("Сальникова Галина Григорівна", ""),
    ("Хобта Людмила Миколаївна", ""),
    ("Протасова Олена Володимирівна", ""),
    ("Сирота Надія Вікторівна", ""),
    ("Капустянська Юлія Олександрівна", ""),
    ("Телегуз Лариса Миколаївна", ""),
    ("Красножон Наталія Миколаївна", ""),
    ("Максюта Леся Анатоліївна", ""),
    ("Коломієць Оксана Анатоліївна", ""),
    ("Білецька Світлана Володимирівна", ""),
    ("Ходаківська Любов Петрівна", ""),
    ("Войтенко Наталія Григорівна", ""),
    ("Мартенко Олена Анатоліївна", ""),
    ("Маховський Микола Володимирович", ""),
    ("Пархоменко Евеліна Анатоліївна", ""),
    ("Ковальчук Тетяна Дмитрівна", ""),
    ("Василишина Анна Дмитрівна", ""),
    ("Черниш Олеся Олександрівна", ""),
    ("Колесник Ганна Миколаївна", ""),
    ("Грищенко Людмила Петрівна", ""),
    ("Харченко Мар'яна Олександрівна", ""),
    ("Мірошніченко Максим Анатолійович", ""),
    ("Омельченко Василь Анатолійович", ""),
    ("Федосенко Світлана Миколаївна", ""),
    ("Федосенко Дмитро Сергійович", ""),
    ("Стась Ольга Іванівна", ""),
    ("Мазур Лариса Вікторівна", ""),
    ("Мишура Світлана Борисівна", ""),
    ("Калашник Лілія Василівна", ""),
    ("Булгакова Світлана Володимирівна", ""),
    ("Багінська Мирослава Сергіївна", ""),
    ("Матвєєва Ольга Павлівна", ""),
    ("Власюк Наталія Миколаївна", ""),
    ("Павленко Ксенія Павлівна", ""),
    ("Толстова Наталія Олександрівна", ""),
    ("Жовтоног О. В.", ""),
    ("Лазоренко Т. О.", ""),
    ("Сергієнко Діана Володимирівна", ""),
    ("Юрьянс Ольга Леонідівна", ""),
    ("Карапетян Ольга Юріївна", ""),
    ("Балацька Наталія Миколаївна", ""),
    ("Кривко Вікторія Миколаївна", ""),
    ("Мирутенко Юлія Володимирівна", ""),
    ("Малинка О. О.", ""),
    ("Заболоцький Р. І.", ""),
    ("Тіхонов С. А", "")
]

# push data
cursor.executemany("INSERT INTO teacher_qualification (teacher_name, qualification) VALUES (?, ?)", data)
conn.commit()

# finish
conn.close()
print("All done!")
